# How do I remove columns from a pandas Dataframe?

In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.shape

(18241, 5)

In [5]:
# 移除欄位
# inplace 加上去才會去除欄位喔~
# 沒加只會消除欄位值
ufo.drop('Colors Reported', axis = 1, inplace = True)
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [6]:
# 去除多欄位
ufo.drop(['City','State'], axis = 1, inplace = True)
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [ ]:
#消除列資料
# axis = 0
ufo.drop([0,1], axis = 0 , inplace = True)

In [ ]:
ufo.head()

In [ ]:
ufo.shape

In [7]:
# boolean filter
ufo = ufo[ufo['Shape Reported'] != 'OTHER']

In [10]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30

In [12]:
ufo = ufo[ufo['Shape Reported'] == 'TRIANGLE']

In [13]:
ufo.shape

(1889, 2)